<?php

// Группа - множество чисел и операция, применяя которую
// над элементами можно получить любые элементы этого же множества и только их.
// Коммутативность === абелева группа

// Группа целых чисел
// Z = {..., -1, 0, 1, ...}
// Операции этой группы
// + - * (* следует из +, 0 следует из -)
// Группа из {1} и этих операций по сути порождает Z
// bZ - подгруппа чисел, кратных b. любая bZ изоморфна Z ("похожа")
// применяя обратную делению операцию, получаем остаток деления

// ОТА - основная теорема арифметики
// Любое число раскладывается в произведение простых чисел ровно одним способом

// Для любых 2 целых чисел (a,b) есть Наибольший ОД (d, d принадлежит [1, min(a, b)]).
// Из этого следует что для них существуют m и n, такие что ma+nb = d

// Сумма Минковского - множество чисел, которые можно получить попарным сложением
// любых чисел из другого множества

// 4Z 4Z+1 4Z+2 4Z+3 (смежные классы) - не пересекаются и по сути делят Z на 4 равные части (остатки по делению)
// Чёт / нечёт - это просто 2Z и 2Z+1

// https://www.youtube.com/watch?v=kKwVrZkvgRg&list=PLH3NNipqeM1vPZjcwzi0hyhdgc7jdyBOv&index=18